
&НаСервере
Процедура ЗапросНаСервере()
	// Вставить содержимое обработчика.

	// Подключение к сайту 1c.alexcode.ru.
// Новый HTTPСоединение(<Сервер>, <Порт>, <Пользователь>, <Пароль>, <Прокси>, <Таймаут>, <ЗащищенноеСоединение>, <ИспользоватьАутентификациюОС>)
СоединениеHTTP = Новый HTTPСоединение("192.168.50.208",20011,,,,, );

// Получение текста главной страницы через запрос.
ЗапросHTTP = Новый HTTPЗапрос("/"); // Можно указать любую нужную страницу например, "/about" или "/contacts"
Ответ = СоединениеHTTP.Получить(ЗапросHTTP); // Get запрос

Если Ответ.КодСостояния = 200 Тогда
	//Сообщить(Ответ.ПолучитьТелоКакСтроку()); //получим HTML-код страницы
	ЭтаФорма.Элементы.ОтветПоЗапросу.Заголовок = Ответ.ПолучитьТелоКакСтроку();
Иначе
	Сообщить("Код ответа: "+Ответ.КодСостояния); //анализируем код состояния и делаем выводы

КонецЕсли;
	КонецПроцедуры

&НаКлиенте
Процедура Запрос(Команда)
	ЗапросНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Сброс(Команда)
	СбросНаСервере();
КонецПроцедуры

&НаСервере
Процедура СбросНаСервере()
	// Вставить содержимое обработчика.
	ЭтаФорма.Элементы.ОтветПоЗапросу.Заголовок = "Нет"

КонецПроцедуры


&НаСервере
Функция получитьJSON()

	ЗаписьJSON = Новый ЗаписьJSON;

    тПараметрыJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет, " ", Истина);
    ЗаписьJSON.УстановитьСтроку(тПараметрыJSON);

    СтруктураДанныхJSON = Новый Структура;
   	 МассивДанныхJSON = Новый Массив;

    тДанные = Новый Структура;
    тДанные.Вставить("fio", ЭтотОбъект.пост_строка);
    тДанные.Вставить("working", "kj");
    МассивДанныхJSON.Добавить(тДанные);

	СтруктураДанныхJSON.Вставить("test", ЭтотОбъект.пост_строка);

    ЗаписатьJSON(ЗаписьJSON, СтруктураДанныхJSON);
    СтрокаJS = ЗаписьJSON.Закрыть();
	Возврат СтрокаJS;

КонецФункции

&НаСервере
Процедура Запрос_постНаСервере()
	СтрокаJS = получитьJSON();
	 Ответ = MES_ОбменСистем.POST_запрос_json(СтрокаJS, "hs/1c/test/v1");
	 Если Ответ = Неопределено Тогда
		 Возврат
	КонецЕсли;
	ЭтаФорма.Элементы.ОтветПоЗапросу.Заголовок = Ответ;

КонецПроцедуры

&НаКлиенте
Процедура Запрос_пост(Команда)
	Запрос_постНаСервере();
КонецПроцедуры
