
#Область Служебная

Функция PostЗапросJson(URL,СтрокаJS,ip,port = Неопределено,ЗащищенноеСоединение=Ложь)    Экспорт
	// Создаем временный файл СтрокаJS, который будет
	// передан в теле POST-запроса

	// Создаем объект HTTP-соединения с заданным сервером
	// Последний параметр указывает будет ли использоваться
	// защищенное соединение
	// устанавливаем соединение с сервером

	Попытка
		Если port = Неопределено Тогда
			HTTP = Новый HTTPСоединение(ip,,,,,60,ЗащищенноеСоединение );
		Иначе
		    HTTP = Новый HTTPСоединение(ip,port,,,,60,ЗащищенноеСоединение );
		КонецЕсли;


	Исключение
	    сообщение_ошибки = "Не удалось установить соединение с сервером ip = " + ip + " port = " + port + " :" + Символы.ПС + ИнформацияОбОшибке().Описание ;
		Сообщить(сообщение_ошибки, СтатусСообщения.Важное);
	    Возврат Неопределено ;
	КонецПопытки ;

		// Отправляем POST-запрос для обработки.
	// Параметры:
	//  1. Файл запроса - путь к файлу, содержащего
	//        тело запроса
	//  2. Ресурс - ссылка на страницу веб-сервера,
	//        к которой выполняется POST-запрос
	//  3. ФайлРезультат - файл, в который будет
	//        помещено тело ответа сервера
	//  4. ЗаголовокHTTP - соответствие с заголовками
	//        POST-запроса
    HTTPЗапрос = Новый HTTPЗапрос(URL);
	HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/json; charset=utf-8" );
    HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаJS, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);

	HTTPОтвет = HTTP.ОтправитьДляОбработки(HTTPЗапрос);
   	// удалим файл отправки - он больше не нужен
		// Получаем ответ веб-сервера на POST-запрос
	Если HTTPОтвет.КодСостояния = 200 Тогда
		Возврат  HTTPОтвет.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8) ;
	Иначе
		сообщение_ошибки = "Сервер вернул ошибку :" + HTTPОтвет.КодСостояния +
		"(" + HTTPОтвет.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8) + ")" ;
		Сообщить(сообщение_ошибки, СтатусСообщения.Важное);
	    Возврат Неопределено ;
	КонецЕсли;
КонецФункции

//id_bitrix_obj: str
//КодСтатусаБ24: str
Процедура ИзменитьСтатусВБ24(id_bitrix_obj,КодСтатусаБ24) Экспорт
	ip_b24 = Константы.ПБ24_АдресПорталаБитрикс.Получить();// "bitrix24.kelast.ru";//"192.168.50.23"    ;
	Если ip_b24 = "" Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Ошибка ПБ24_АдресПорталаБитрикс не установлено значение, при отправке статуса в Б24" ;
		Сообщение.Поле = "";
		Сообщение.УстановитьДанные();
		Сообщение.Сообщить();
		Возврат
	КонецЕсли;
	key_b24 = Константы.ПБ24_КлючПодключенияRest.Получить();
	Если key_b24 = "" Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Ошибка ПБ24_КлючПодключенияRest не установлено значение, при отправке статуса в Б24" ;
		Сообщение.Поле = "";
		Сообщение.УстановитьДанные();
		Сообщение.Сообщить();
		Возврат
	КонецЕсли;

	СтруктураДанныхJSON = Новый Структура;
	СтруктураДанныхJSON.Вставить("ID",  id_bitrix_obj);
	СтруктураДанныхJSONFIELDS = Новый Структура;
	СтруктураДанныхJSONFIELDS.Вставить("STAGE_ID", КодСтатусаБ24);
	СтруктураДанныхJSON.Вставить("FIELDS", СтруктураДанныхJSONFIELDS);
	СтрокаJS = Д_ОбщийМодульСервер.ПолучитьСтрокуJSON(СтруктураДанныхJSON);
	uri = "/rest/3342/"+ key_b24+"/crm.deal.update/?id="  + id_bitrix_obj ;
	ответ = Д_ОбменБ24.PostЗапросJson(uri,СтрокаJS, ip_b24,,Истина);
	Если ответ = Неопределено Тогда
		HOSTNAME_PORT =  Константы.ПБ24_АдресПортMES.Получить();
		Массив_HOSTNAME_PORT   =  СтрРазделить(HOSTNAME_PORT, ":");
		Если НЕ Массив_HOSTNAME_PORT.Количество() = 2 Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Ошибка разбора ПБ24_АдресПортMES при отправке статуса в Б24" ;
			Сообщение.Поле = "";
			Сообщение.УстановитьДанные();
			Сообщение.Сообщить();
			Возврат
		КонецЕсли;
		HOSTNAME =  Массив_HOSTNAME_PORT[0];
		PORT = Число(Массив_HOSTNAME_PORT[1]);
		uri = "/hs/mes/send_drawback_journal/v1" ;
		ответ = Д_ОбменБ24.PostЗапросJson(uri,СтрокаJS, HOSTNAME,PORT);
	КонецЕсли;


КонецПроцедуры

Функция ПолучитьКодСтатусаБ24(НазваниеСтатуса) Экспорт
	СтатусСделкиОбъект = Справочники.ПБ24_СтатусыСделокБ24.НайтиПоНаименованию(НазваниеСтатуса);
	Если СтатусСделкиОбъект = Неопределено Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "КодСтатусаБ24 не найден " + НазваниеСтатуса + " статус с Б24 не синхронизирован" ;
		Сообщение.Поле = "";
		Сообщение.УстановитьДанные();
		Сообщение.Сообщить();
		Возврат Неопределено;
	КонецЕсли;
	КодСтатусаБ24 = СтатусСделкиОбъект.Код;

	Возврат КодСтатусаБ24  ;
КонецФункции // ПолучитьКодСтатусаБ24()


#КонецОбласти