
&НаСервере
Процедура ЗагрузитьНаСервере()


	// Вставить содержимое обработчика.
	Если ЭтаФорма.Объект.ЦФО.Ссылка = Справочники.СтруктураПредприятия.ПустаяСсылка() Тогда
		Сообщить(            "Не выбрано ЦФО");
		Возврат
	КонецЕсли;
	Если ЭтаФорма.ВыборМесяца = "" Тогда
		Сообщить(            "Не выбран Месяц");
		Возврат
	КонецЕсли;
	Если ЭтаФорма.ВыборГода = 0 Тогда
		Сообщить(            "Не выбран Год");
		Возврат
	КонецЕсли;


    СтруктураДанныхJSON = Новый Структура;
	СтруктураДанныхJSON.Вставить("direction_key", ЭтаФорма.Объект.ЦФО.Ссылка.Код);
	СтруктураДанныхJSON.Вставить("month", ЭтаФорма.ВыборМесяца);
    СтруктураДанныхJSON.Вставить("year", ЭтаФорма.ВыборГода);

	СтрокаJS = MES_РаботаСДаннымиСервер.ПолучитьСтрокуJSON(СтруктураДанныхJSON);

	ответ = MES_ОбменСистем.POST_запрос_json(СтрокаJS,"/hs/1c/budget/v1")   ;
	Если ответ = Неопределено Тогда
		Возврат
	КонецЕсли;
	тз = Новый ТаблицаЗначений;
	СписокСписковСловарей = MES_РаботаСДаннымиСервер.JSONВДанные(ответ);
	тз = MES_РаботаСДаннымиСервер.СписокСловарейВТЗ(СписокСписковСловарей,тз) ;
	//тз.ВыгрузитьКолонку("Кол_5")
	MES_РаботаСФормами.ЗаполнитьТаблицуФормы( ЭтотОбъект, "АналитикаБюджетов", ЭтаФорма, "АналитикаБюджетов", тз, "Отклонение, руб.");


КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
	ОчиститьСообщения();
	ЗагрузитьНаСервере();
	//ОбновитьОтображениеДанных();

КонецПроцедуры
