
&После("ПриКопировании")
Процедура MES_ПриКопировании(ОбъектКопирования)
	ЗаполнитьПриКопировании(ЭтотОбъект,ОбъектКопирования);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПриКопировании(ЭтотОбъект,ОбъектКопирования)  Экспорт
    // Вставить содержимое обработчика.
	СсылкаНового = Документы.ЗаказПоставщику.ПолучитьСсылку(Новый УникальныйИдентификатор);
	ФлагПереноса = Ложь;
	ФлагПолучения = Ложь;
	ТЗИсходная = ОбъектКопирования.MES_ТоварыДеталировка.Выгрузить();
	Для каждого строкаОК Из ТЗИсходная Цикл
		Если строкаОК.ЗабратьВКопию = Истина Тогда
			об_ВЗП = строкаОК.ВиртуальныйЗаказПоставщику.ПолучитьОбъект();
			//Смена ссылки на новый объект
			Для каждого строка_ВЗП Из об_ВЗП.Товары Цикл
				Если строка_ВЗП.ИдентификаторСтроки = строкаОК.ИдентификаторСтрокиВиртуальныйЗаказПоставщику Тогда
					строка_ВЗП.MES_ЗППотребитель  = СсылкаНового;
					ФлагПолучения = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			об_ВЗП.Записать();
			//Сброс флага на забор в новом документе
			Для каждого строкаНовый Из ЭтотОбъект.MES_ТоварыДеталировка Цикл
				Если строкаНовый.ИдентификаторСтрокиВиртуальныйЗаказПоставщику = строкаОК.ИдентификаторСтрокиВиртуальныйЗаказПоставщику Тогда
					строкаНовый.ЗабратьВКопию = Ложь;
					ФлагПолучения = Истина;
				КонецЕсли;
			КонецЦикла;
			//Удаление из ТЧ в старом документе
			Для каждого строкаСтарый Из ОбъектКопирования.MES_ТоварыДеталировка Цикл
				Если строкаСтарый.ИдентификаторСтрокиВиртуальныйЗаказПоставщику = строкаОК.ИдентификаторСтрокиВиртуальныйЗаказПоставщику Тогда
					ОбъектКопирования.MES_ТоварыДеталировка.Удалить(строкаСтарый);
					ФлагПереноса = Истина;
				КонецЕсли;
			КонецЦикла;

			Иначе
			//Удаление из ТЧ в новом документе
			Для каждого строкаНовый Из ЭтотОбъект.MES_ТоварыДеталировка Цикл
				Если строкаНовый.ИдентификаторСтрокиВиртуальныйЗаказПоставщику = строкаОК.ИдентификаторСтрокиВиртуальныйЗаказПоставщику Тогда
					ЭтотОбъект.MES_ТоварыДеталировка.Удалить(строкаНовый);
					ФлагПолучения = Истина;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	Если ФлагПереноса Тогда
		ОбъектКопирования.Записать();
	КонецЕсли;
	Если ФлагПолучения Тогда
	    ЭтотОбъект.УстановитьСсылкуНового(СсылкаНового);
		ЭтотОбъект.Дата = ТекущаяДата();
		ЭтотОбъект.УстановитьНовыйНомер();
		ЭтотОбъект.УстановитьВремя();

		ЭтотОбъект.Записать();
	КонецЕсли;
	//ЭтотОбъект.MES_ТоварыДеталировка.Очистить();

КонецПроцедуры


