&НаКлиенте
Перем ВыбраннаяНоменклатура; //Массив, хранящий отмеченную галочками номенклатуру для отображения в списке

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	//Инициализация массива
	ВыбраннаяНоменклатура = Новый Массив;

	//Без параметра, даже пустого, список выдаст ошибку и будет прав
	Список.Параметры.УстановитьЗначениеПараметра("ВыбраннаяНоменклатура", ВыбраннаяНоменклатура);

КонецПроцедуры

&НаКлиенте
Процедура СнятьПометку(Номенклатура)
	Индекс=0;
	Для каждого эл Из ВыбраннаяНоменклатура Цикл
		Если MES_РаботаСДаннымиКлиент.МассивыИдентичны(эл, Номенклатура) Тогда
			ВыбраннаяНоменклатура.Удалить(Индекс);
			Прервать;
		КонецЕсли  ;

	    Индекс = Индекс + 1;
	КонецЦикла;


КонецПроцедуры

&НаКлиенте
Процедура ПоставитьПометку(Номенклатура)
	Для каждого эл Из ВыбраннаяНоменклатура Цикл
		Если MES_РаботаСДаннымиКлиент.МассивыИдентичны(эл, Номенклатура) Тогда
			Возврат;
		КонецЕсли
	КонецЦикла;
	ВыбраннаяНоменклатура.Добавить(Номенклатура);
КонецПроцедуры






// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
&НаСервере
Функция ПолучитьДанныеПоУИС(УИДы, Ссылки)
     	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗаказПоставщикуТовары.Ссылка.Дата КАК Дата,
		|	ВЫБОР
		|		КОГДА ЗаказПоставщикуТовары.Ссылка.ПоступлениеОднойДатой = ИСТИНА
		|			ТОГДА ЗаказПоставщикуТовары.Ссылка.ЖелаемаяДатаПоступления
		|		ИНАЧЕ ЗаказПоставщикуТовары.ДатаОтгрузки
		|	КОНЕЦ КАК ЖелаемаяДатаПоступления,
		|	ЗаказПоставщикуТовары.КоличествоУпаковок КАК КоличествоУпаковок,
		|	ЗаказПоставщикуТовары.Номенклатура КАК Номенклатура,
		|	ЗаказПоставщикуТовары.Ссылка.Номер КАК Номер,
		|	ЗаказПоставщикуТовары.ИдентификаторСтроки КАК ИдентификаторСтроки,
		|	ЗаказПоставщикуТовары.Упаковка КАК Упаковка,
		|	ЗаказПоставщикуТовары.Количество КАК КоличествоТовара
		|ИЗ
		|	Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
		|ГДЕ
		|	ЗаказПоставщикуТовары.ИдентификаторСтроки В(&УИДы)
		|	И ЗаказПоставщикуТовары.Ссылка В(&Ссылки)";

	Запрос.УстановитьПараметр("УИДы", УИДы);
	Запрос.УстановитьПараметр("Ссылки", Ссылки);

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	РезультатМассив = Новый Массив;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
		Результат = Новый Структура;
		Результат.Вставить("Дата",ВыборкаДетальныеЗаписи.Дата);
		Результат.Вставить("ДатаОтгрузки",ВыборкаДетальныеЗаписи.ЖелаемаяДатаПоступления);
		Результат.Вставить("КоличествоУпаковок",ВыборкаДетальныеЗаписи.КоличествоУпаковок);
		Результат.Вставить("Номенклатура",ВыборкаДетальныеЗаписи.Номенклатура);
		Результат.Вставить("Номер",ВыборкаДетальныеЗаписи.Номер);
		Результат.Вставить("Упаковка",ВыборкаДетальныеЗаписи.Упаковка);
		Результат.Вставить("КоличествоТовара",ВыборкаДетальныеЗаписи.КоличествоТовара);

		Результат.Вставить("ИдентификаторСтрокиВиртуальныйЗаказПоставщику",ВыборкаДетальныеЗаписи.ИдентификаторСтроки);

		РезультатМассив.Добавить(Результат);
	КонецЦикла;

	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	Возврат РезультатМассив;


КонецФункции // ПолучитьДанныеПоУИС()







&НаКлиенте
Процедура ЗабратьСтроку()
	// Вставить содержимое обработчика.
	Если ВыбраннаяНоменклатура.Количество() = 0 Тогда
		ПоказатьОповещениеПользователя("Ошибка компоновки",
                              ,
                               "Не выбрана ни одна позиция",
                               );
		Возврат;
	КонецЕсли;

	УИДы = УИД_ссылка_ИзВыбраннойНоменклатуры("УИД");
	Ссылки = УИД_ссылка_ИзВыбраннойНоменклатуры("ссылка");

	РезультатМассив = ПолучитьДанныеПоУИС(УИДы,Ссылки);


	ОповеститьОВыборе(РезультатМассив);
КонецПроцедуры

&НаКлиенте
Процедура Забрать(Команда)
	// Вставить содержимое обработчика.
	ЗабратьСтроку();
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	//Нас интересует только событие нажатия на чекбокс
	Если Поле = Элементы.Выбрано Тогда

		СтандартнаяОбработка = Ложь;

		ТекущиеДанные = Элемент.ТекущиеДанные;

		Если ТекущиеДанные.Отменено Тогда
			Сообщить("Нелья выбрать отмененный товар");
			Возврат ;
		КонецЕсли;
		ЗП_УИД = новый Массив;
		ЗП_УИД.Добавить(ТекущиеДанные.Номер);
		ЗП_УИД.Добавить(ТекущиеДанные.ИдентификаторСтроки);

		Если ТекущиеДанные <> Неопределено Тогда
			Если ТекущиеДанные.Выбрано Тогда
				СнятьПометку(ЗП_УИД);
			Иначе
				ПоставитьПометку(ЗП_УИД);
			КонецЕсли;
		КонецЕсли;

	КонецЕсли;
	УИДы = УИД_ссылка_ИзВыбраннойНоменклатуры("УИД");
	//Параметр в динамическом списке нужно обновить
	Список.Параметры.УстановитьЗначениеПараметра("ВыбраннаяНоменклатура", УИДы);

	Элементы.Список.Обновить();

КонецПроцедуры

&НаКлиенте
Функция УИД_ссылка_ИзВыбраннойНоменклатуры(вычленить="УИД")
	Результат = новый Массив;
	Для каждого номен Из ВыбраннаяНоменклатура Цикл
	    ссылка = номен[0];
		уидСтроки = номен[1];
		Если вычленить =  "УИД" Тогда
			Результат.Добавить(уидСтроки);
		Иначе
			 Результат.Добавить(ссылка);
		КонецЕсли;

	КонецЦикла;
	Возврат Результат;
КонецФункции



