   &НаКлиенте
Перем ВыбраннаяНоменклатура;
&НаСервере
Функция ПолучитьЗначениеЗавершен()


  Возврат Перечисления.СтатусыЭтаповПроизводства2_2.Завершен;
КонецФункции


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// Вставить содержимое обработчика.
	ВыбраннаяНоменклатура = Новый Массив;

	Список.Параметры.УстановитьЗначениеПараметра("ВыбраннаяНоменклатура", ВыбраннаяНоменклатура);
	Список.Параметры.УстановитьЗначениеПараметра("СтатсусЭтапаЗавершен", ПолучитьЗначениеЗавершен());

КонецПроцедуры

&НаКлиенте
Процедура Забрать(Команда)
	// Вставить содержимое обработчика.

	РезультатМассив = Новый Массив;
	ОповеститьОВыборе(РезультатМассив);
КонецПроцедуры


&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	//Нас интересует только событие нажатия на чекбокс
	Если Поле = Элементы.Пометка Тогда

		СтандартнаяОбработка = Ложь;

		ТекущиеДанные = Элемент.ТекущиеДанные;
		Если ТекущиеДанные <> Неопределено Тогда
			уид = Новый УникальныйИдентификатор(ТекущиеДанные.УИД);
			Если ТекущиеДанные.Пометка Тогда
				СнятьПометку(уид);
			Иначе
				ПоставитьПометку(уид);
			КонецЕсли;
		КонецЕсли;

	КонецЕсли;

	//Параметр в динамическом списке нужно обновить
	Список.Параметры.УстановитьЗначениеПараметра("ВыбраннаяНоменклатура", ВыбраннаяНоменклатура);

	Элементы.Список.Обновить();

КонецПроцедуры

&НаКлиенте
Процедура СнятьПометку(ИдентификаторСтроки)
	Индекс = ВыбраннаяНоменклатура.Найти(ИдентификаторСтроки);
	Если Индекс >= 0 Тогда
		ВыбраннаяНоменклатура.Удалить(Индекс);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПоставитьПометку(ИдентификаторСтроки)
	Индекс = ВыбраннаяНоменклатура.Найти(ИдентификаторСтроки);
	Если Индекс = Неопределено Тогда
		ВыбраннаяНоменклатура.Добавить(ИдентификаторСтроки);
	КонецЕсли;
КонецПроцедуры