Функция Настройки_мес() Экспорт
	Струк = Новый Структура;

	объект_настроек = ХранилищеОбщихНастроек.Загрузить("НастройкиMES", "РежимДоступаMESНастройки")    ;
	Если объект_настроек = Неопределено тогда
		Выборка = Справочники.MES_Настройки.Выбрать();
		Пока Выборка.Следующий() Цикл
						Для каждого Реквизит Из Метаданные.Справочники.MES_Настройки.Реквизиты Цикл
						Струк.Вставить(Реквизит.Имя, Выборка[Реквизит.Имя]);
						КонецЦикла;

						Прервать;
		КонецЦикла;
	Иначе
	Для каждого Реквизит Из Метаданные.Справочники.MES_Настройки.Реквизиты Цикл
						Струк.Вставить(Реквизит.Имя, объект_настроек[Реквизит.Имя]);
	КонецЦикла;

	КонецЕсли;
	Возврат Струк;

КонецФункции


Функция СписокСловарейВТЗ(СписокСписковСловарей,тз)   Экспорт
	Если СписокСписковСловарей.Количество() = 0 Тогда
		Возврат тз;
	КонецЕсли;
	инд_кол = 0   ;
	Для каждого  список Из СписокСписковСловарей[0] Цикл
		ИмяКол = "Кол_" + Строка(инд_кол);
		тз.Колонки.Добавить(ИмяКол);
		Для каждого элемент Из список[0] Цикл
			тз.Колонки[ИмяКол].Заголовок = элемент.Ключ;
			Прервать;
		КонецЦикла;
		инд_кол = инд_кол + 1;
	КонецЦикла;

	//заполняем таблицу значений
	Для индекс = 0 по СписокСписковСловарей.Количество()-1 Цикл
		НоваяСтрока = тз.Добавить();
		Для каждого  список Из 	СписокСписковСловарей[индекс] Цикл
			элементСоотв = новый Соответствие;
			Для каждого элемент_списка Из список[0] Цикл
				элементСоотв = элемент_списка;
				Прервать;
			КонецЦикла;
			Для каждого колонкаТЗ из ТЗ.Колонки Цикл
				Если колонкаТЗ.Заголовок = элементСоотв.Ключ Тогда
					НоваяСтрока[колонкаТЗ.Имя] = элементСоотв.Значение;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	Возврат тз;
КонецФункции


Функция JSONВДанные(ответ)  Экспорт
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(ответ);
	ОбъектИзJSON = ПрочитатьJSON(ЧтениеJSON, Истина);
	ЧтениеJSON.Закрыть();
	Возврат ОбъектИзJSON;
КонецФункции

 Функция ПолучитьСтрокуJSON(СтруктураДанныхJSON)   Экспорт
	json = Новый ЗаписьJSON;
	ПараметрыJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет, " ", Истина);
	json.УстановитьСтроку(ПараметрыJSON);


	ЗаписатьJSON(json, СтруктураДанныхJSON);
	СтрокаJS = json.Закрыть();
	Возврат СтрокаJS;
КонецФункции


Функция ПолучитьДатуИзФорматМЕС(ДатаСтрока) Экспорт
	Если СтрНайти(СокрЛП(ДатаСтрока),"-") Тогда
		ДатаТрудозатрат = СтрЗаменить(СокрЛП(ДатаСтрока), "-", "");
		ДатаТрудозатрат = СтрЗаменить(ДатаТрудозатрат, " ", "");
		ДатаТрудозатрат = СтрЗаменить(ДатаТрудозатрат, ":", "");
		ДатаТрудозатрат = Дата(ДатаТрудозатрат);
	Иначе
		ДатаТрудозатрат = Дата(СокрЛП(ДатаСтрока));
	КонецЕсли;
    Возврат ДатаТрудозатрат;
КонецФункции

Функция РезультатЗапросаВМассив(Знач РезультатЗапроса) Экспорт
	ТаблицаЗначений  =  РезультатЗапроса.Выгрузить();
	ВыходнойМассив = Новый Массив;
	//создадим шаблон для строки
	СписокКолонок = "";
	Для каждого Колонка Из ТаблицаЗначений.Колонки Цикл
		СписокКолонок = СписокКолонок + ?(СписокКолонок = "", "", ",") + Колонка.Имя;
	КонецЦикла;
	//обойдем каждую строку таблицы значений
	Для каждого СтрокаТЗ Из ТаблицаЗначений Цикл
		СтруктураСтроки = Новый Структура(СписокКолонок);
		//скопируем значения ячеек строки в структуру
		ЗаполнитьЗначенияСвойств(СтруктураСтроки, СтрокаТЗ);
		//и поместим их в выходную структуру по индексу строки
		Для каждого КиЗ Из СтруктураСтроки Цикл
				ТипДанных =  ТипЗнч(КиЗ.Значение);
				Если ТипДанных = Тип("Число") или ТипДанных = Тип("Строка") Тогда

				Иначе

			 	СтруктураСтроки[КиЗ.Ключ] = Строка(КиЗ.Значение);

				КонецЕсли;

		КонецЦикла;
		ВыходнойМассив.Добавить(СтруктураСтроки);
		//ВыходнаяСтруктура.Вставить("Строка" + ТаблицаЗначений.Индекс(СтрокаТЗ), СтруктураСтроки);
	КонецЦикла;
	Возврат ВыходнойМассив;
КонецФункции