
 &НаСервере
 Процедура ЗаполнитьТаблицуФормы(Объект, Знач ИмяРеквизитаДанныеФормыКоллекция ,Форма ,Знач ИмяПоляТаблицыФормы,
	  Знач ТаблицаЗначений,ИмяПоляИтога = "")  Экспорт
    Форма.Элементы[ИмяПоляТаблицыФормы].Подвал = Ложь;

    //// Если руками не создали эелемент формы Таблица, то создается программно
    //Если Элементы.Найти(ИмяПоляТаблицыФормы) = Неопределено Тогда
    //    ЭлементРеквизита = Элементы.Добавить(ИмяПоляТаблицыФормы, Тип("ТаблицаФормы"),);
    //    ЭлементРеквизита.ПутьКДанным = ИмяРеквизитаДанныеФормыКоллекция;
    //КонецЕсли;
    //
    УдаляемыеРеквизиты = Новый Массив; //Удалять можно только ранее программно добавленные реквизиты.
    РеквизитыДляУдаления = Объект.ПолучитьРеквизиты(ИмяРеквизитаДанныеФормыКоллекция);
    Для Каждого РеквизитУдаления Из РеквизитыДляУдаления Цикл
        УдаляемыеРеквизиты.Добавить(ИмяРеквизитаДанныеФормыКоллекция+"."+РеквизитУдаления.Имя);
        // Удаляем элементы формы
        Форма.Элементы.Удалить(Форма.Элементы[ИмяПоляТаблицыФормы+РеквизитУдаления.Имя]);
    КонецЦикла;

    // Добавление реквизитов в таблицу формы
    ДобавляемыеРеквизиты = Новый Массив;
    Для каждого Колонка Из ТаблицаЗначений.Колонки Цикл
        ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(Колонка.Имя, Колонка.ТипЗначения, ИмяРеквизитаДанныеФормыКоллекция, Колонка.Заголовок));
    КонецЦикла;
    Объект.ИзменитьРеквизиты(ДобавляемыеРеквизиты,УдаляемыеРеквизиты);

    // Добавление элементов форму
    Для каждого Колонка Из ТаблицаЗначений.Колонки Цикл
        ЭлементРеквизита = Форма.Элементы.Добавить(ИмяПоляТаблицыФормы + Колонка.Имя, Тип("ПолеФормы"), Форма.Элементы[ИмяПоляТаблицыФормы]);
        ЭлементРеквизита.ПутьКДанным = ИмяРеквизитаДанныеФормыКоллекция + "." + Колонка.Имя;
        ЭлементРеквизита.Вид = ВидПоляФормы.ПолеВвода;
		Если НЕ ИмяПоляИтога = "" Тогда
			Если Колонка.Заголовок = ИмяПоляИтога Тогда
				Форма.Элементы[ИмяПоляТаблицыФормы].ПодчиненныеЭлементы[ИмяРеквизитаДанныеФормыКоллекция + Колонка.Имя].ТекстПодвала = "Итого: " + ТаблицаЗначений.Итог(Колонка.Имя);
				Форма.Элементы[ИмяПоляТаблицыФормы].Подвал = Истина;
				Если  ТаблицаЗначений.Итог(Колонка.Имя) < 0 Тогда
					 Форма.Элементы[ИмяПоляТаблицыФормы].ПодчиненныеЭлементы[ИмяРеквизитаДанныеФормыКоллекция + Колонка.Имя].ЦветТекстаПодвала = WebЦвета.Красный   ;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
    КонецЦикла;

    Объект.ЗначениеВРеквизитФормы(ТаблицаЗначений, ИмяРеквизитаДанныеФормыКоллекция);
КонецПроцедуры
