Функция ПолучитьСтрокуJSON(СтруктураДанныхJSON)   Экспорт
	json = Новый ЗаписьJSON;
	ПараметрыJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет, " ", Истина);
	json.УстановитьСтроку(ПараметрыJSON);


	ЗаписатьJSON(json, СтруктураДанныхJSON);
	СтрокаJS = json.Закрыть();
	Возврат СтрокаJS;
КонецФункции


Функция JSONВДанные(ответ)  Экспорт
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(ответ);
	ОбъектИзJSON = ПрочитатьJSON(ЧтениеJSON, Истина);
	ЧтениеJSON.Закрыть();
	Возврат ОбъектИзJSON;
КонецФункции


Функция СписокСловарейВТЗ(СписокСписковСловарей,тз)   Экспорт
	Если СписокСписковСловарей.Количество() = 0 Тогда
		Возврат тз;
	КонецЕсли;
	инд_кол = 0   ;
	Для каждого  список Из СписокСписковСловарей[0] Цикл
		ИмяКол = "Кол_" + Строка(инд_кол);
		тз.Колонки.Добавить(ИмяКол);
		Для каждого элемент Из список[0] Цикл
			тз.Колонки[ИмяКол].Заголовок = элемент.Ключ;
			Прервать;
		КонецЦикла;
		инд_кол = инд_кол + 1;
	КонецЦикла;

	//заполняем таблицу значений
	Для индекс = 0 по СписокСписковСловарей.Количество()-1 Цикл
		НоваяСтрока = тз.Добавить();
		Для каждого  список Из 	СписокСписковСловарей[индекс] Цикл
			элементСоотв = новый Соответствие;
			Для каждого элемент_списка Из список[0] Цикл
				элементСоотв = элемент_списка;
				Прервать;
			КонецЦикла;
			Для каждого колонкаТЗ из ТЗ.Колонки Цикл
				Если колонкаТЗ.Заголовок = элементСоотв.Ключ Тогда
					НоваяСтрока[колонкаТЗ.Имя] = элементСоотв.Значение;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	Возврат тз;
КонецФункции

Функция ПолучитьДатуИзФорматМЕС(ДатаСтрока) Экспорт
	Если СтрНайти(СокрЛП(ДатаСтрока),"-") Тогда
		ДатаТрудозатрат = СтрЗаменить(СокрЛП(ДатаСтрока), "-", "");
		ДатаТрудозатрат = СтрЗаменить(ДатаТрудозатрат, " ", "");
		ДатаТрудозатрат = СтрЗаменить(ДатаТрудозатрат, ":", "");
		ДатаТрудозатрат = Дата(ДатаТрудозатрат);
	Иначе
		ДатаТрудозатрат = Дата(СокрЛП(ДатаСтрока));
	КонецЕсли;
    Возврат ДатаТрудозатрат;
КонецФункции


// Сравнивает два массива однотипных значений (кроме коллекций значений)
//
// Параметры:
//  ПервыйМассив,ВторойМассив - сравниваемые массивы
//
// Возвращаемое значение:
//  булево.
//
Функция МассивыИдентичны(ПервыйМассив,ВторойМассив) Экспорт

    ЭлементовМассива = ПервыйМассив.Количество();
	МассивыСовпадают = (ЭлементовМассива = ВторойМассив.Количество());

	Если МассивыСовпадают Тогда
		Для Сч = 1 По ЭлементовМассива Цикл
			Если ПервыйМассив[Сч-1] <> ВторойМассив[Сч-1] Тогда
				Возврат Ложь
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	Возврат МассивыСовпадают

КонецФункции

